{
  "_name_or_path": "/nobackup/eenzinger1/models/mrhubert/large/",
  "architectures": [
    "MRHubertAASIST"
  ],
  "finetuning_task": "audio-classification",
  "gradient_checkpointing": false,
  "hidden_size": 1024,
  "id2label": {
    "0": "fake",
    "1": "real"
  },
  "label2id": {
    "fake": 0,
    "real": 1
  },
  "model_type": "MRHubertAASIST",
  "output_hidden_size": 1024,
  "s3prl_model_path": "/nobackup/eenzinger1/models/mrhubert/mrhubert_multi_large.pt",
  "torch_dtype": "float32",
  "transformers_version": "4.35.0"
}
